st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xxxxx.h
#define DMA1_CSELR_CH5_USART6_RX_Msk    (0xDU << DMA1_CSELR_CH5_USART6_RX_Pos) /*!< 0x000D0000 */
#define DMA1_CSELR_CH5_USART6_RX        DMA1_CSELR_CH5_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA1 channel 5 */
#if defined(STM32F091xC) || defined(STM32F098xx)
#define DMA1_CSELR_CH5_USART7_RX_Pos    (17U)                                  
#define DMA1_CSELR_CH5_USART7_RX_Msk    (0x7U << DMA1_CSELR_CH5_USART7_RX_Pos) /*!< 0x000E0000 */
#define DMA1_CSELR_CH5_USART7_RX        DMA1_CSELR_CH5_USART7_RX_Msk           /*!< Remap USART7 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH5_USART8_RX_Pos    (16U)                                  
#define DMA1_CSELR_CH5_USART8_RX_Msk    (0xFU << DMA1_CSELR_CH5_USART8_RX_Pos) /*!< 0x000F0000 */
#define DMA1_CSELR_CH5_USART8_RX        DMA1_CSELR_CH5_USART8_RX_Msk           /*!< Remap USART8 Rx on DMA1 channel 5 */
#define DMA1_CSELR_CH6_I2C1_TX_Pos      (21U)                                  
#define DMA1_CSELR_CH6_I2C1_TX_Msk      (0x1U << DMA1_CSELR_CH6_I2C1_TX_Pos)   /*!< 0x00200000 */
#define DMA1_CSELR_CH6_I2C1_TX          DMA1_CSELR_CH6_I2C1_TX_Msk             /*!< Remap I2C1 Tx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_SPI2_RX_Pos      (20U)                                  
#define DMA1_CSELR_CH6_SPI2_RX_Msk      (0x3U << DMA1_CSELR_CH6_SPI2_RX_Pos)   /*!< 0x00300000 */
#define DMA1_CSELR_CH6_SPI2_RX          DMA1_CSELR_CH6_SPI2_RX_Msk             /*!< Remap SPI2 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM1_CH1_Pos     (22U)                                  
#define DMA1_CSELR_CH6_TIM1_CH1_Msk     (0x1U << DMA1_CSELR_CH6_TIM1_CH1_Pos)  /*!< 0x00400000 */
#define DMA1_CSELR_CH6_TIM1_CH1         DMA1_CSELR_CH6_TIM1_CH1_Msk            /*!< Remap TIM1 channel 1 on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM1_CH2_Pos     (22U)                                  
#define DMA1_CSELR_CH6_TIM1_CH2_Msk     (0x1U << DMA1_CSELR_CH6_TIM1_CH2_Pos)  /*!< 0x00400000 */
#define DMA1_CSELR_CH6_TIM1_CH2         DMA1_CSELR_CH6_TIM1_CH2_Msk            /*!< Remap TIM1 channel 2 on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM1_CH3_Pos     (22U)                                  
#define DMA1_CSELR_CH6_TIM1_CH3_Msk     (0x1U << DMA1_CSELR_CH6_TIM1_CH3_Pos)  /*!< 0x00400000 */
#define DMA1_CSELR_CH6_TIM1_CH3         DMA1_CSELR_CH6_TIM1_CH3_Msk            /*!< Remap TIM1 channel 3 on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM3_CH1_Pos     (21U)                                  
#define DMA1_CSELR_CH6_TIM3_CH1_Msk     (0x3U << DMA1_CSELR_CH6_TIM3_CH1_Pos)  /*!< 0x00600000 */
#define DMA1_CSELR_CH6_TIM3_CH1         DMA1_CSELR_CH6_TIM3_CH1_Msk            /*!< Remap TIM3 channel 1 on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM3_TRIG_Pos    (21U)                                  
#define DMA1_CSELR_CH6_TIM3_TRIG_Msk    (0x3U << DMA1_CSELR_CH6_TIM3_TRIG_Pos) /*!< 0x00600000 */
#define DMA1_CSELR_CH6_TIM3_TRIG        DMA1_CSELR_CH6_TIM3_TRIG_Msk           /*!< Remap TIM3 Trig on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM16_CH1_Pos    (20U)                                  
#define DMA1_CSELR_CH6_TIM16_CH1_Msk    (0x7U << DMA1_CSELR_CH6_TIM16_CH1_Pos) /*!< 0x00700000 */
#define DMA1_CSELR_CH6_TIM16_CH1        DMA1_CSELR_CH6_TIM16_CH1_Msk           /*!< Remap TIM16 channel 1 on DMA1 channel 6 */
#define DMA1_CSELR_CH6_TIM16_UP_Pos     (20U)                                  
#define DMA1_CSELR_CH6_TIM16_UP_Msk     (0x7U << DMA1_CSELR_CH6_TIM16_UP_Pos)  /*!< 0x00700000 */
#define DMA1_CSELR_CH6_TIM16_UP         DMA1_CSELR_CH6_TIM16_UP_Msk            /*!< Remap TIM16 up on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART1_RX_Pos    (23U)                                  
#define DMA1_CSELR_CH6_USART1_RX_Msk    (0x1U << DMA1_CSELR_CH6_USART1_RX_Pos) /*!< 0x00800000 */
#define DMA1_CSELR_CH6_USART1_RX        DMA1_CSELR_CH6_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART2_RX_Pos    (20U)                                  
#define DMA1_CSELR_CH6_USART2_RX_Msk    (0x9U << DMA1_CSELR_CH6_USART2_RX_Pos) /*!< 0x00900000 */
#define DMA1_CSELR_CH6_USART2_RX        DMA1_CSELR_CH6_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART3_RX_Pos    (21U)                                  
#define DMA1_CSELR_CH6_USART3_RX_Msk    (0x5U << DMA1_CSELR_CH6_USART3_RX_Pos) /*!< 0x00A00000 */
#define DMA1_CSELR_CH6_USART3_RX        DMA1_CSELR_CH6_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART4_RX_Pos    (20U)                                  
#define DMA1_CSELR_CH6_USART4_RX_Msk    (0xBU << DMA1_CSELR_CH6_USART4_RX_Pos) /*!< 0x00B00000 */
#define DMA1_CSELR_CH6_USART4_RX        DMA1_CSELR_CH6_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART5_RX_Pos    (22U)                                  
#define DMA1_CSELR_CH6_USART5_RX_Msk    (0x3U << DMA1_CSELR_CH6_USART5_RX_Pos) /*!< 0x00C00000 */
#define DMA1_CSELR_CH6_USART5_RX        DMA1_CSELR_CH6_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART6_RX_Pos    (20U)                                  
#define DMA1_CSELR_CH6_USART6_RX_Msk    (0xDU << DMA1_CSELR_CH6_USART6_RX_Pos) /*!< 0x00D00000 */
#define DMA1_CSELR_CH6_USART6_RX        DMA1_CSELR_CH6_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART7_RX_Pos    (21U)                                  
#define DMA1_CSELR_CH6_USART7_RX_Msk    (0x7U << DMA1_CSELR_CH6_USART7_RX_Pos) /*!< 0x00E00000 */
#define DMA1_CSELR_CH6_USART7_RX        DMA1_CSELR_CH6_USART7_RX_Msk           /*!< Remap USART7 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH6_USART8_RX_Pos    (20U)                                  
#define DMA1_CSELR_CH6_USART8_RX_Msk    (0xFU << DMA1_CSELR_CH6_USART8_RX_Pos) /*!< 0x00F00000 */
#define DMA1_CSELR_CH6_USART8_RX        DMA1_CSELR_CH6_USART8_RX_Msk           /*!< Remap USART8 Rx on DMA1 channel 6 */
#define DMA1_CSELR_CH7_I2C1_RX_Pos      (25U)                                  
#define DMA1_CSELR_CH7_I2C1_RX_Msk      (0x1U << DMA1_CSELR_CH7_I2C1_RX_Pos)   /*!< 0x02000000 */
#define DMA1_CSELR_CH7_I2C1_RX          DMA1_CSELR_CH7_I2C1_RX_Msk             /*!< Remap I2C1 Rx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_SPI2_TX_Pos      (24U)                                  
#define DMA1_CSELR_CH7_SPI2_TX_Msk      (0x3U << DMA1_CSELR_CH7_SPI2_TX_Pos)   /*!< 0x03000000 */
#define DMA1_CSELR_CH7_SPI2_TX          DMA1_CSELR_CH7_SPI2_TX_Msk             /*!< Remap SPI2 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_TIM2_CH2_Pos     (24U)                                  
#define DMA1_CSELR_CH7_TIM2_CH2_Msk     (0x5U << DMA1_CSELR_CH7_TIM2_CH2_Pos)  /*!< 0x05000000 */
#define DMA1_CSELR_CH7_TIM2_CH2         DMA1_CSELR_CH7_TIM2_CH2_Msk            /*!< Remap TIM2 channel 2 on DMA1 channel 7 */
#define DMA1_CSELR_CH7_TIM2_CH4_Pos     (24U)                                  
#define DMA1_CSELR_CH7_TIM2_CH4_Msk     (0x5U << DMA1_CSELR_CH7_TIM2_CH4_Pos)  /*!< 0x05000000 */
#define DMA1_CSELR_CH7_TIM2_CH4         DMA1_CSELR_CH7_TIM2_CH4_Msk            /*!< Remap TIM2 channel 4 on DMA1 channel 7 */
#define DMA1_CSELR_CH7_TIM17_CH1_Pos    (24U)                                  
#define DMA1_CSELR_CH7_TIM17_CH1_Msk    (0x7U << DMA1_CSELR_CH7_TIM17_CH1_Pos) /*!< 0x07000000 */
#define DMA1_CSELR_CH7_TIM17_CH1        DMA1_CSELR_CH7_TIM17_CH1_Msk           /*!< Remap TIM17 channel 1 on DMA1 channel 7 */
#define DMA1_CSELR_CH7_TIM17_UP_Pos     (24U)                                  
#define DMA1_CSELR_CH7_TIM17_UP_Msk     (0x7U << DMA1_CSELR_CH7_TIM17_UP_Pos)  /*!< 0x07000000 */
#define DMA1_CSELR_CH7_TIM17_UP         DMA1_CSELR_CH7_TIM17_UP_Msk            /*!< Remap TIM17 up on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART1_TX_Pos    (27U)                                  
#define DMA1_CSELR_CH7_USART1_TX_Msk    (0x1U << DMA1_CSELR_CH7_USART1_TX_Pos) /*!< 0x08000000 */
#define DMA1_CSELR_CH7_USART1_TX        DMA1_CSELR_CH7_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART2_TX_Pos    (24U)                                  
#define DMA1_CSELR_CH7_USART2_TX_Msk    (0x9U << DMA1_CSELR_CH7_USART2_TX_Pos) /*!< 0x09000000 */
#define DMA1_CSELR_CH7_USART2_TX        DMA1_CSELR_CH7_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART3_TX_Pos    (25U)                                  
#define DMA1_CSELR_CH7_USART3_TX_Msk    (0x5U << DMA1_CSELR_CH7_USART3_TX_Pos) /*!< 0x0A000000 */
#define DMA1_CSELR_CH7_USART3_TX        DMA1_CSELR_CH7_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART4_TX_Pos    (24U)                                  
#define DMA1_CSELR_CH7_USART4_TX_Msk    (0xBU << DMA1_CSELR_CH7_USART4_TX_Pos) /*!< 0x0B000000 */
#define DMA1_CSELR_CH7_USART4_TX        DMA1_CSELR_CH7_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART5_TX_Pos    (26U)                                  
#define DMA1_CSELR_CH7_USART5_TX_Msk    (0x3U << DMA1_CSELR_CH7_USART5_TX_Pos) /*!< 0x0C000000 */
#define DMA1_CSELR_CH7_USART5_TX        DMA1_CSELR_CH7_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART6_TX_Pos    (24U)                                  
#define DMA1_CSELR_CH7_USART6_TX_Msk    (0xDU << DMA1_CSELR_CH7_USART6_TX_Pos) /*!< 0x0D000000 */
#define DMA1_CSELR_CH7_USART6_TX        DMA1_CSELR_CH7_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART7_TX_Pos    (25U)                                  
#define DMA1_CSELR_CH7_USART7_TX_Msk    (0x7U << DMA1_CSELR_CH7_USART7_TX_Pos) /*!< 0x0E000000 */
#define DMA1_CSELR_CH7_USART7_TX        DMA1_CSELR_CH7_USART7_TX_Msk           /*!< Remap USART7 Tx on DMA1 channel 7 */
#define DMA1_CSELR_CH7_USART8_TX_Pos    (24U)                                  
#define DMA1_CSELR_CH7_USART8_TX_Msk    (0xFU << DMA1_CSELR_CH7_USART8_TX_Pos) /*!< 0x0F000000 */
#define DMA1_CSELR_CH7_USART8_TX        DMA1_CSELR_CH7_USART8_TX_Msk           /*!< Remap USART8 Tx on DMA1 channel 7 */

