st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xxxxx.h
#endif
#endif
#if defined(STM32F091xC) || defined(STM32F098xx)
/******************  Bit definition for DMA2_CSELR register  ********************/
#define DMA2_CSELR_DEFAULT              (0x00000000U)                          /*!< Default remap position for DMA2 */
#define DMA2_CSELR_CH1_I2C2_TX_Pos      (1U)                                   
#define DMA2_CSELR_CH1_I2C2_TX_Msk      (0x1U << DMA2_CSELR_CH1_I2C2_TX_Pos)   /*!< 0x00000002 */
#define DMA2_CSELR_CH1_I2C2_TX          DMA2_CSELR_CH1_I2C2_TX_Msk             /*!< Remap I2C2 TX on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART1_TX_Pos    (3U)                                   
#define DMA2_CSELR_CH1_USART1_TX_Msk    (0x1U << DMA2_CSELR_CH1_USART1_TX_Pos) /*!< 0x00000008 */
#define DMA2_CSELR_CH1_USART1_TX        DMA2_CSELR_CH1_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART2_TX_Pos    (0U)                                   
#define DMA2_CSELR_CH1_USART2_TX_Msk    (0x9U << DMA2_CSELR_CH1_USART2_TX_Pos) /*!< 0x00000009 */
#define DMA2_CSELR_CH1_USART2_TX        DMA2_CSELR_CH1_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART3_TX_Pos    (1U)                                   
#define DMA2_CSELR_CH1_USART3_TX_Msk    (0x5U << DMA2_CSELR_CH1_USART3_TX_Pos) /*!< 0x0000000A */
#define DMA2_CSELR_CH1_USART3_TX        DMA2_CSELR_CH1_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART4_TX_Pos    (0U)                                   
#define DMA2_CSELR_CH1_USART4_TX_Msk    (0xBU << DMA2_CSELR_CH1_USART4_TX_Pos) /*!< 0x0000000B */
#define DMA2_CSELR_CH1_USART4_TX        DMA2_CSELR_CH1_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART5_TX_Pos    (2U)                                   
#define DMA2_CSELR_CH1_USART5_TX_Msk    (0x3U << DMA2_CSELR_CH1_USART5_TX_Pos) /*!< 0x0000000C */
#define DMA2_CSELR_CH1_USART5_TX        DMA2_CSELR_CH1_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART6_TX_Pos    (0U)                                   
#define DMA2_CSELR_CH1_USART6_TX_Msk    (0xDU << DMA2_CSELR_CH1_USART6_TX_Pos) /*!< 0x0000000D */
#define DMA2_CSELR_CH1_USART6_TX        DMA2_CSELR_CH1_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART7_TX_Pos    (1U)                                   
#define DMA2_CSELR_CH1_USART7_TX_Msk    (0x7U << DMA2_CSELR_CH1_USART7_TX_Pos) /*!< 0x0000000E */
#define DMA2_CSELR_CH1_USART7_TX        DMA2_CSELR_CH1_USART7_TX_Msk           /*!< Remap USART7 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH1_USART8_TX_Pos    (0U)                                   
#define DMA2_CSELR_CH1_USART8_TX_Msk    (0xFU << DMA2_CSELR_CH1_USART8_TX_Pos) /*!< 0x0000000F */
#define DMA2_CSELR_CH1_USART8_TX        DMA2_CSELR_CH1_USART8_TX_Msk           /*!< Remap USART8 Tx on DMA2 channel 1 */
#define DMA2_CSELR_CH2_I2C2_RX_Pos      (5U)                                   
#define DMA2_CSELR_CH2_I2C2_RX_Msk      (0x1U << DMA2_CSELR_CH2_I2C2_RX_Pos)   /*!< 0x00000020 */
#define DMA2_CSELR_CH2_I2C2_RX          DMA2_CSELR_CH2_I2C2_RX_Msk             /*!< Remap I2C2 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART1_RX_Pos    (7U)                                   
#define DMA2_CSELR_CH2_USART1_RX_Msk    (0x1U << DMA2_CSELR_CH2_USART1_RX_Pos) /*!< 0x00000080 */
#define DMA2_CSELR_CH2_USART1_RX        DMA2_CSELR_CH2_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART2_RX_Pos    (4U)                                   
#define DMA2_CSELR_CH2_USART2_RX_Msk    (0x9U << DMA2_CSELR_CH2_USART2_RX_Pos) /*!< 0x00000090 */
#define DMA2_CSELR_CH2_USART2_RX        DMA2_CSELR_CH2_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART3_RX_Pos    (5U)                                   
#define DMA2_CSELR_CH2_USART3_RX_Msk    (0x5U << DMA2_CSELR_CH2_USART3_RX_Pos) /*!< 0x000000A0 */
#define DMA2_CSELR_CH2_USART3_RX        DMA2_CSELR_CH2_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART4_RX_Pos    (4U)                                   
#define DMA2_CSELR_CH2_USART4_RX_Msk    (0xBU << DMA2_CSELR_CH2_USART4_RX_Pos) /*!< 0x000000B0 */
#define DMA2_CSELR_CH2_USART4_RX        DMA2_CSELR_CH2_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART5_RX_Pos    (6U)                                   
#define DMA2_CSELR_CH2_USART5_RX_Msk    (0x3U << DMA2_CSELR_CH2_USART5_RX_Pos) /*!< 0x000000C0 */
#define DMA2_CSELR_CH2_USART5_RX        DMA2_CSELR_CH2_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART6_RX_Pos    (4U)                                   
#define DMA2_CSELR_CH2_USART6_RX_Msk    (0xDU << DMA2_CSELR_CH2_USART6_RX_Pos) /*!< 0x000000D0 */
#define DMA2_CSELR_CH2_USART6_RX        DMA2_CSELR_CH2_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART7_RX_Pos    (5U)                                   
#define DMA2_CSELR_CH2_USART7_RX_Msk    (0x7U << DMA2_CSELR_CH2_USART7_RX_Pos) /*!< 0x000000E0 */
#define DMA2_CSELR_CH2_USART7_RX        DMA2_CSELR_CH2_USART7_RX_Msk           /*!< Remap USART7 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH2_USART8_RX_Pos    (4U)                                   
#define DMA2_CSELR_CH2_USART8_RX_Msk    (0xFU << DMA2_CSELR_CH2_USART8_RX_Pos) /*!< 0x000000F0 */
#define DMA2_CSELR_CH2_USART8_RX        DMA2_CSELR_CH2_USART8_RX_Msk           /*!< Remap USART8 Rx on DMA2 channel 2 */
#define DMA2_CSELR_CH3_TIM6_UP_Pos      (8U)                                   
#define DMA2_CSELR_CH3_TIM6_UP_Msk      (0x1U << DMA2_CSELR_CH3_TIM6_UP_Pos)   /*!< 0x00000100 */
#define DMA2_CSELR_CH3_TIM6_UP          DMA2_CSELR_CH3_TIM6_UP_Msk             /*!< Remap TIM6 up on DMA2 channel 3 */
#define DMA2_CSELR_CH3_DAC_CH1_Pos      (8U)                                   
#define DMA2_CSELR_CH3_DAC_CH1_Msk      (0x1U << DMA2_CSELR_CH3_DAC_CH1_Pos)   /*!< 0x00000100 */
#define DMA2_CSELR_CH3_DAC_CH1          DMA2_CSELR_CH3_DAC_CH1_Msk             /*!< Remap DAC channel 1 on DMA2 channel 3 */
#define DMA2_CSELR_CH3_SPI1_RX_Pos      (8U)                                   
#define DMA2_CSELR_CH3_SPI1_RX_Msk      (0x3U << DMA2_CSELR_CH3_SPI1_RX_Pos)   /*!< 0x00000300 */
#define DMA2_CSELR_CH3_SPI1_RX          DMA2_CSELR_CH3_SPI1_RX_Msk             /*!< Remap SPI1 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART1_RX_Pos    (11U)                                  
#define DMA2_CSELR_CH3_USART1_RX_Msk    (0x1U << DMA2_CSELR_CH3_USART1_RX_Pos) /*!< 0x00000800 */
#define DMA2_CSELR_CH3_USART1_RX        DMA2_CSELR_CH3_USART1_RX_Msk           /*!< Remap USART1 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART2_RX_Pos    (8U)                                   
#define DMA2_CSELR_CH3_USART2_RX_Msk    (0x9U << DMA2_CSELR_CH3_USART2_RX_Pos) /*!< 0x00000900 */
#define DMA2_CSELR_CH3_USART2_RX        DMA2_CSELR_CH3_USART2_RX_Msk           /*!< Remap USART2 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART3_RX_Pos    (9U)                                   
#define DMA2_CSELR_CH3_USART3_RX_Msk    (0x5U << DMA2_CSELR_CH3_USART3_RX_Pos) /*!< 0x00000A00 */
#define DMA2_CSELR_CH3_USART3_RX        DMA2_CSELR_CH3_USART3_RX_Msk           /*!< Remap USART3 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART4_RX_Pos    (8U)                                   
#define DMA2_CSELR_CH3_USART4_RX_Msk    (0xBU << DMA2_CSELR_CH3_USART4_RX_Pos) /*!< 0x00000B00 */
#define DMA2_CSELR_CH3_USART4_RX        DMA2_CSELR_CH3_USART4_RX_Msk           /*!< Remap USART4 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART5_RX_Pos    (10U)                                  
#define DMA2_CSELR_CH3_USART5_RX_Msk    (0x3U << DMA2_CSELR_CH3_USART5_RX_Pos) /*!< 0x00000C00 */
#define DMA2_CSELR_CH3_USART5_RX        DMA2_CSELR_CH3_USART5_RX_Msk           /*!< Remap USART5 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART6_RX_Pos    (8U)                                   
#define DMA2_CSELR_CH3_USART6_RX_Msk    (0xDU << DMA2_CSELR_CH3_USART6_RX_Pos) /*!< 0x00000D00 */
#define DMA2_CSELR_CH3_USART6_RX        DMA2_CSELR_CH3_USART6_RX_Msk           /*!< Remap USART6 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART7_RX_Pos    (9U)                                   
#define DMA2_CSELR_CH3_USART7_RX_Msk    (0x7U << DMA2_CSELR_CH3_USART7_RX_Pos) /*!< 0x00000E00 */
#define DMA2_CSELR_CH3_USART7_RX        DMA2_CSELR_CH3_USART7_RX_Msk           /*!< Remap USART7 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH3_USART8_RX_Pos    (8U)                                   
#define DMA2_CSELR_CH3_USART8_RX_Msk    (0xFU << DMA2_CSELR_CH3_USART8_RX_Pos) /*!< 0x00000F00 */
#define DMA2_CSELR_CH3_USART8_RX        DMA2_CSELR_CH3_USART8_RX_Msk           /*!< Remap USART8 Rx on DMA2 channel 3 */
#define DMA2_CSELR_CH4_TIM7_UP_Pos      (12U)                                  
#define DMA2_CSELR_CH4_TIM7_UP_Msk      (0x1U << DMA2_CSELR_CH4_TIM7_UP_Pos)   /*!< 0x00001000 */
#define DMA2_CSELR_CH4_TIM7_UP          DMA2_CSELR_CH4_TIM7_UP_Msk             /*!< Remap TIM7 up on DMA2 channel 4 */
#define DMA2_CSELR_CH4_DAC_CH2_Pos      (12U)                                  
#define DMA2_CSELR_CH4_DAC_CH2_Msk      (0x1U << DMA2_CSELR_CH4_DAC_CH2_Pos)   /*!< 0x00001000 */
#define DMA2_CSELR_CH4_DAC_CH2          DMA2_CSELR_CH4_DAC_CH2_Msk             /*!< Remap DAC channel 2 on DMA2 channel 4 */
#define DMA2_CSELR_CH4_SPI1_TX_Pos      (12U)                                  
#define DMA2_CSELR_CH4_SPI1_TX_Msk      (0x3U << DMA2_CSELR_CH4_SPI1_TX_Pos)   /*!< 0x00003000 */
#define DMA2_CSELR_CH4_SPI1_TX          DMA2_CSELR_CH4_SPI1_TX_Msk             /*!< Remap SPI1 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART1_TX_Pos    (15U)                                  
#define DMA2_CSELR_CH4_USART1_TX_Msk    (0x1U << DMA2_CSELR_CH4_USART1_TX_Pos) /*!< 0x00008000 */
#define DMA2_CSELR_CH4_USART1_TX        DMA2_CSELR_CH4_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART2_TX_Pos    (12U)                                  
#define DMA2_CSELR_CH4_USART2_TX_Msk    (0x9U << DMA2_CSELR_CH4_USART2_TX_Pos) /*!< 0x00009000 */
#define DMA2_CSELR_CH4_USART2_TX        DMA2_CSELR_CH4_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART3_TX_Pos    (13U)                                  
#define DMA2_CSELR_CH4_USART3_TX_Msk    (0x5U << DMA2_CSELR_CH4_USART3_TX_Pos) /*!< 0x0000A000 */
#define DMA2_CSELR_CH4_USART3_TX        DMA2_CSELR_CH4_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART4_TX_Pos    (12U)                                  
#define DMA2_CSELR_CH4_USART4_TX_Msk    (0xBU << DMA2_CSELR_CH4_USART4_TX_Pos) /*!< 0x0000B000 */
#define DMA2_CSELR_CH4_USART4_TX        DMA2_CSELR_CH4_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART5_TX_Pos    (14U)                                  
#define DMA2_CSELR_CH4_USART5_TX_Msk    (0x3U << DMA2_CSELR_CH4_USART5_TX_Pos) /*!< 0x0000C000 */
#define DMA2_CSELR_CH4_USART5_TX        DMA2_CSELR_CH4_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART6_TX_Pos    (12U)                                  
#define DMA2_CSELR_CH4_USART6_TX_Msk    (0xDU << DMA2_CSELR_CH4_USART6_TX_Pos) /*!< 0x0000D000 */
#define DMA2_CSELR_CH4_USART6_TX        DMA2_CSELR_CH4_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART7_TX_Pos    (13U)                                  
#define DMA2_CSELR_CH4_USART7_TX_Msk    (0x7U << DMA2_CSELR_CH4_USART7_TX_Pos) /*!< 0x0000E000 */
#define DMA2_CSELR_CH4_USART7_TX        DMA2_CSELR_CH4_USART7_TX_Msk           /*!< Remap USART7 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH4_USART8_TX_Pos    (12U)                                  
#define DMA2_CSELR_CH4_USART8_TX_Msk    (0xFU << DMA2_CSELR_CH4_USART8_TX_Pos) /*!< 0x0000F000 */
#define DMA2_CSELR_CH4_USART8_TX        DMA2_CSELR_CH4_USART8_TX_Msk           /*!< Remap USART8 Tx on DMA2 channel 4 */
#define DMA2_CSELR_CH5_ADC_Pos          (16U)                                  
#define DMA2_CSELR_CH5_ADC_Msk          (0x1U << DMA2_CSELR_CH5_ADC_Pos)       /*!< 0x00010000 */
#define DMA2_CSELR_CH5_ADC              DMA2_CSELR_CH5_ADC_Msk                 /*!< Remap ADC on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART1_TX_Pos    (19U)                                  
#define DMA2_CSELR_CH5_USART1_TX_Msk    (0x1U << DMA2_CSELR_CH5_USART1_TX_Pos) /*!< 0x00080000 */
#define DMA2_CSELR_CH5_USART1_TX        DMA2_CSELR_CH5_USART1_TX_Msk           /*!< Remap USART1 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART2_TX_Pos    (16U)                                  
#define DMA2_CSELR_CH5_USART2_TX_Msk    (0x9U << DMA2_CSELR_CH5_USART2_TX_Pos) /*!< 0x00090000 */
#define DMA2_CSELR_CH5_USART2_TX        DMA2_CSELR_CH5_USART2_TX_Msk           /*!< Remap USART2 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART3_TX_Pos    (17U)                                  
#define DMA2_CSELR_CH5_USART3_TX_Msk    (0x5U << DMA2_CSELR_CH5_USART3_TX_Pos) /*!< 0x000A0000 */
#define DMA2_CSELR_CH5_USART3_TX        DMA2_CSELR_CH5_USART3_TX_Msk           /*!< Remap USART3 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART4_TX_Pos    (16U)                                  
#define DMA2_CSELR_CH5_USART4_TX_Msk    (0xBU << DMA2_CSELR_CH5_USART4_TX_Pos) /*!< 0x000B0000 */
#define DMA2_CSELR_CH5_USART4_TX        DMA2_CSELR_CH5_USART4_TX_Msk           /*!< Remap USART4 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART5_TX_Pos    (18U)                                  
#define DMA2_CSELR_CH5_USART5_TX_Msk    (0x3U << DMA2_CSELR_CH5_USART5_TX_Pos) /*!< 0x000C0000 */
#define DMA2_CSELR_CH5_USART5_TX        DMA2_CSELR_CH5_USART5_TX_Msk           /*!< Remap USART5 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART6_TX_Pos    (16U)                                  
#define DMA2_CSELR_CH5_USART6_TX_Msk    (0xDU << DMA2_CSELR_CH5_USART6_TX_Pos) /*!< 0x000D0000 */
#define DMA2_CSELR_CH5_USART6_TX        DMA2_CSELR_CH5_USART6_TX_Msk           /*!< Remap USART6 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART7_TX_Pos    (17U)                                  
#define DMA2_CSELR_CH5_USART7_TX_Msk    (0x7U << DMA2_CSELR_CH5_USART7_TX_Pos) /*!< 0x000E0000 */
#define DMA2_CSELR_CH5_USART7_TX        DMA2_CSELR_CH5_USART7_TX_Msk           /*!< Remap USART7 Tx on DMA2 channel 5 */
#define DMA2_CSELR_CH5_USART8_TX_Pos    (16U)                                  
#define DMA2_CSELR_CH5_USART8_TX_Msk    (0xFU << DMA2_CSELR_CH5_USART8_TX_Pos) /*!< 0x000F0000 */
#define DMA2_CSELR_CH5_USART8_TX        DMA2_CSELR_CH5_USART8_TX_Msk           /*!< Remap USART8 Tx on DMA2 channel 5 */

